Revit 2027 API
Space.ClosedShell Property
Return the closedShell of the space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GeometryElement ClosedShell { get; }
Public ReadOnly Property ClosedShell As GeometryElement
	Get
public:
property GeometryElement^ ClosedShell {
	GeometryElement^ get ();
}
member ClosedShell : GeometryElement with get
Property Value
GeometryElement
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace